EncostAki/app/controllers/risk_areas_controller.rb

  def index
    @risk_areas = RiskArea.all
---
SELECT "risk_areas".* FROM "risk_areas"