EncostAki/app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets"
---
  def index
    @tickets = Ticket.all