EncostAki/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "cpf", "username", "cep", "complement", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Pedro"], ["cpf", 1215587777], ["username", "pvls"], ["cep", 55604255], ["complement", ""], ["created_at", "2017-10-04 16:31:30.701960"], ["updated_at", "2017-10-04 16:31:30.701960"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "cpf" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["cpf", 1234344575], ["updated_at", "2017-10-03 21:57:27.272390"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)